#+title: Day4
** Basic hello World in C
#+begin_src C :tangle hello.c :results output :exports both
#include<stdio.h>
int main(){
    printf("Hello, World\n");
}
#+end_src

#+RESULTS:
: Hello, World

** Basic OpenMP Example
#+begin_src C :tangle hello_omp.c :results output
#include <stdio.h>
#include <omp.h>

int main() {
    #pragma omp parallel
    {
        printf("Hello, World : line1\n");
        printf("Hello, World : line2\n");
    }
    return 0;
}
#+end_src

#+RESULTS:
: Hello, World : line1
: Hello, World : line2

** Running OpenMP Programs
Example:
#+begin_src bash :results output :exports both
./hello_omp.out
#+end_src

#+RESULTS:
#+begin_example
Hello, World : line1
Hello, World : line2
Hello, World : line1
Hello, World : line2
Hello, World : line1
Hello, World : line1
Hello, World : line1
Hello, World : line2
Hello, World : line2
Hello, World : line2
Hello, World : line1
Hello, World : line1
Hello, World : line2
Hello, World : line2
Hello, World : line1
Hello, World : line2
Hello, World : line1
Hello, World : line2
Hello, World : line1
Hello, World : line1
Hello, World : line2
Hello, World : line2
Hello, World : line1
Hello, World : line2
#+end_example

** run
#+begin_src bash :results output :exports both
./hello1.out
#+end_src

#+RESULTS:
#+begin_example
Hello from first parallel region
Hello from first parallel region
Hello from first parallel region
Hello from first parallel region
Hello from first parallel region
Hello from first parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
Hello from second parallel region
#+end_example

** run
#+begin_src bash :results output :exports both
./hello2.out
#+end_src

#+RESULTS:
#+begin_example
Total number of threads before parallel region : 1
Hello from first parallel region
Total number of threads inside first parallel region : 6
Hello from first parallel region
Total number of threads inside first parallel region : 6
Hello from first parallel region
Hello from first parallel region
Hello from first parallel region
Total number of threads inside first parallel region : 6
Total number of threads inside first parallel region : 6
Total number of threads inside first parallel region : 6
Hello from first parallel region
Total number of threads inside first parallel region : 6
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Hello from second parallel region
Total number of threads inside second parallel region : 14
Total number of threads inside second parallel region : 14
Total number of threads after parallel region : 1
#+end_example

** run
#+begin_src bash :results output :exports both
./hello3.out
#+end_src

#+RESULTS:
: Hello from thread 5
: Hello from thread 0
: Hello from thread 1
: Hello from thread 3
: Hello from thread 2
: Hello from thread 4

** run
#+begin_src bash :results output :exports both
./hello4.out
#+end_src

#+RESULTS:
: executing task2 by thread 1
: executing task1 by thread 0

** run
#+begin_src bash :results output :exports both
./task1.out
#+end_src

#+RESULTS:
: Value of C for thread 2 is 15
: Value of C for thread 3 is 15
: Value of C for thread 1 is 13
: Value of C for thread 0 is 12
